In [31]:
import numpy as np

Pandasのライブラリのインポート

In [3]:
import pandas as pd

from pandas import Series, DataFrame

Seriesの使い方

In [5]:
# Series
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [7]:
# indexをアルファベットでつける
sample_pandas_index_data = pd.Series(
    [0,10,20,30,40,50,60,70,80,90],
    index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [8]:
print('データの値：', sample_pandas_data.values)
print('インデックスの値：', sample_pandas_index_data.index)

データの値： [ 0 10 20 30 40 50 60 70 80 90]
インデックスの値： Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

DataFrameの使い方

In [9]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_frame1 = DataFrame(attri_data1)

print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [10]:
attri_data_frame_index1 = DataFrame(attri_data1, index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

In [11]:
attri_data_frame_index1

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

行列操作

転置

In [12]:
# 転置
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

特定列のみ取り出す

In [13]:
# 列名の指定（１つの場合）
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [14]:
# 列名の指定（複数の場合）
attri_data_frame1[['ID', 'Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

データの抽出

In [15]:
# 条件（フィルター）
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [16]:
attri_data_frame1['City'] == 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [18]:
# 条件(フィルター、複数の値)
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

データの削除と結合

列や行の削除

In [19]:
attri_data_frame1.drop(['Birth_year'], axis=1)

    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka    Akiko
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

データの結合

In [20]:
# 別データの準備
attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}

attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [21]:
# データのマージ
pd.merge(attri_data_frame1, attri_data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

集計

In [22]:
# データのグループ集計
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

In [26]:
# データのグループ集計
attri_data_frame2.groupby('Sex')['English'].mean()

Sex
F    25.000000
M    56.666667
Name: English, dtype: float64

In [24]:
attri_data_frame2.groupby('Sex')['English'].max()

Sex
F    30
M    90
Name: English, dtype: int64

In [25]:
attri_data_frame2.groupby('Sex')['English'].min()

Sex
F    20
M    30
Name: English, dtype: int64

値のソート

In [27]:
# データの準備
attri_data2 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame_index2 = DataFrame(attri_data2, index=['e','b','a','b','c'])
attri_data_frame_index2

    ID      City  Birth_year     Name
e  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
a  102     Kyoto        1992     Yuki
b  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve

In [28]:
# indexによるソート
attri_data_frame_index2.sort_index()

    ID      City  Birth_year     Name
a  102     Kyoto        1992     Yuki
b  101     Osaka        1989    Akiko
b  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve
e  100     Tokyo        1990  Hiroshi

In [29]:
# 値によるソート、デフォルトは昇順
attri_data_frame_index2.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
b    1997
Name: Birth_year, dtype: int64

nan(null)の判定

条件に合致したデータの比較

In [30]:
# 値があるかどうかの確認
attri_data_frame_index2.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
b  False  False       False  False
c  False   True       False  False

nanとnullの例

In [32]:
# 欠損地の扱い
# nameをすべてnanにする
attri_data_frame_index2['Name'] = np.nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
b  False  False       False  True
c  False  False       False  True

In [33]:
# nullを判定し、合計する
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64